Tekla Open API Reference for Tekla Structures 2025
AnalysisBar.Add Method
Overload List
Name | Description
Add(AnalysisPosition)
 Adds a position to the analysis bar.
Add(AnalysisPosition, AnalysisMember)
 Adds a position and member to the analysis bar.
Top
See Also
Reference
AnalysisBar Class
Tekla.Structures.Analysis Namespace